:LOGINSERVER
{	
	BindIP = "0.0.0.0"		// bind IP
	Port = 30000		// Port	
	CreateWorker = 100		// 생성 워커 스레드
	ActiveWorker = 8		// 활성화 워커스레드
	CreateAccept = 1		// 생성 엑셉트 스레드
	HeadCode = 119		// 헤더 코드
	XorCode1 = 50		// XorCode 1번
	XorCode2 = 132		// XorCode 2번
	Nodelay = 0		// Nodelay. 1이면 노딜레이 옵션 적용(네이글 알고리즘 적용)
	MaxJoinUser = 17000	// 최대 접속 가능 유저 수
	LogLevel	= 0		// 0 : 디버그 / 1 : 위험 / 2 : 에러 / 3 :  시스템
}

:IPCONFIG
{
	// GameServerIP = "192.168.10.119"
	// GameServerPort = 12000
	ChatServerIP = "127.0.0.1"
	ChatServerPort = 12001
}

:ACCOUNTDBCONFIG
{
	DBIP = "127.0.0.1"
	DBUser = "root"
	DBPassword = "034689"
	DBName = "AccountDB"
	DBPort = 3306
}

:LANSERVER
{
	LanBindIP = "0.0.0.0"		// bind IP
	LanPort = 12478		// Port	
	LanCreateWorker = 4		// 생성 워커 스레드
	LanActiveWorker = 2		// 활성화 워커스레드
	LanCreateAccept = 1		// 생성 엑셉트 스레드
	LanNodelay = 0		// Nodelay. 1이면 노딜레이 옵션 적용(네이글 알고리즘 적용)
	LanMaxJoinUser = 1000	// 최대 접속 가능 유저 수
	LanLogLevel	= 0		// 0 : 디버그 / 1 : 위험 / 2 : 에러 / 3 :  시스템
}

:MONITORCLIENT
{
	MonitorServerIP = "127.0.0.1"	// 모니터링 서버(LanServer)의 IP
	MonitorServerPort = 18246		// 모니터링 서버(LanServer)의 Port
	ClientCreateWorker = 1		// 생성 워커 스레드 
	ClientActiveWorker = 1		// 활성화 워커 스레드
	ClientNodelay = 0			// Nodelay. 1이면 노딜레이 옵션 적용(네이글 알고리즘 적용)	
}
